course/set theory 1/homework/9/homework10.tex
% Created 2021-12-05 Sun 20:24
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\input{../../../preamble-lite.tex}
\usepackage[UTF8]{ctex}
\author{陈淇奥\\21210160025}
\date{\today}
\title{Homework10}
\hypersetup{
 pdfauthor={陈淇奥\\21210160025},
 pdftitle={Homework10},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 27.2 (Org mode 9.6)}, 
 pdflang={English}}
\begin{document}

\maketitle
\begin{exercise}[3.4.6]
令\(\kappa\)为不可数正则基数，举出一个例子，使得\(X=\{C_\alpha\mid\alpha<\kappa\}\)是\(\kappa\)上的无界闭集的族，而\(\bigcap X=\emptyset\)，但
是\(\bigtriangleup_{\alpha<\kappa}C_\alpha=\kappa\)
\end{exercise}

\begin{proof}
令\(C_\alpha=\{x\in\kappa\mid x>\alpha\}\)
\end{proof}

\begin{exercise}[3.4.7]
如果令\(Y_\alpha=\{\xi\in X_\alpha\mid\xi>\alpha\}\)，则\(\bigtriangleup_{\alpha<\kappa}X_\alpha=\bigtriangleup_{\alpha<\kappa}Y_\alpha\)
\end{exercise}

\begin{proof}
\(x\in\bigtriangleup_{\alpha<\kappa}X_\alpha\Leftrightarrow x\in\bigcap_{\xi<x}X_\xi\Leftrightarrow\forall\xi<x(x\in X_\xi)\Leftrightarrow\forall\xi<x(x\in Y_\xi)\Leftrightarrow x\in\bigtriangleup_{\alpha<\kappa}Y_\alpha\)
\end{proof}

\begin{exercise}[3.4.8]
\(\bigtriangleup_{\alpha<\kappa}X_\alpha=\bigcap_{\alpha<\kappa}(X_\alpha\cup\{\xi\mid\xi\le\alpha\})\)
\end{exercise}

\begin{proof}
对于任意 \(\eta\in\bigcap_{\alpha<\kappa}(X_\alpha\cup\{\xi\mid\xi\le\alpha\})\), 当 \(\beta<\eta\),有 \(\eta\in X_\beta\). 因此 \(\eta\in\bigtriangleup_{\alpha<\kappa}X_\alpha\)

另一个方向显然
\end{proof}

\begin{exercise}[3.4.16]
如果\(\alpha>\aleph_0\)是正则基数，并且\(f:\alpha\to\alpha\)是函数，则集合\(C=\{\beta<\alpha\mid f[\beta]\subseteq\beta\}\)是\(\alpha\)上的无界闭集
\end{exercise}

\begin{proof}
令\(C_\xi=\{\beta\mid f(\xi)<\beta<\alpha\}\)，于是\(C=\bigtriangleup_{\xi<\alpha}C_\xi\)。因为\(C_\xi\)是无界闭集，因此\(C\)是无界闭集
\end{proof}

\begin{exercise}[3.4.21]
如果\(\kappa\)是不可达基数，则集合\(\{\lambda<\kappa\mid\lambda\text{ 是强极限基数}\}\)是\(\kappa\)上的无界闭集
\end{exercise}

\begin{proof}
令\(S=\{\lambda<\kappa\mid\lambda\text{是强极限基数}\}\)

无界：对任意\(\alpha<\kappa\)，\(\beth_\omega(\alpha)<\kappa\)并且是强极限基数

闭：对于任意极限序数\(\eta<\kappa\)并且\(\sup(C\cap\eta)=\eta\)，则对任意\(\lambda<\eta\)，因为\(S\)无界，存在\(\xi\in S\)使
得\(\lambda<\xi\)，因为\(\xi\)是强极限基数，因此\(2^\lambda<\xi<\eta\)，因此\(\eta\)是强极限基数，于是\(\eta\in S\)
\end{proof}

\begin{exercise}
一个无穷基数\(\kappa\)是 \textbf{马洛基数} (Mahlo cardinal)当且仅当\(\kappa\)是不可达基数并
且\(\{\lambda<\kappa\mid\lambda\text{是正则基数}\}\)是\(\kappa\)上的平稳集。如果\(\kappa\)是马洛基数，
则\(\{\lambda<\kappa\mid\lambda\text{是不可达基数}\}\)是\(\kappa\)上的平稳集，因此\(\kappa\)是第\(\kappa\)个不可达基数
\end{exercise}

\begin{proof}
令\(A=\{\lambda<\kappa\mid\lambda\text{正则}\}\)，\(B=\{\lambda<\kappa\mid\lambda\text{不可达}\}\)，\(C=\{\lambda<\kappa\mid\text{强极限}\}\)，\(A\)是平稳集，\(C\)是无界闭集

对于任意\(\kappa\)上的无界闭集\(D\)，\(B\cap D=A\cap C\cap D\)非空，因此\(B\)是平稳集
\end{proof}
\end{document}
